//
//   ___           ___        ___      ___        ___
//  /\  \         /\  \      /\  \    /\  \      /\  \
//  \ \  \        \ \  \_____\ \  \   \ \  \_____\ \  \
//   \ \  \        \ \  \_____\ \  \   \ \  \_____\ \  \
//    \ \  \______  \ \  \     \ \  \   \ \  \     \ \  \
//     \ \________\  \ \__\     \ \__\   \ \__\     \ \__\
//      \/________/   \/__/      \/__/    \/__/      \/__/
//
//  欢欢为人民服务
//  有问题请联系我，http://www.jianshu.com/u/3c6ff28fdc63
//
// -----------------------------------------------------------------------------


#import "LHHModel.h"

@interface LHHReadModel : LHHModel

/**
 *  是否加从数据源获取过数据，加载缓存不改变这个值
 */
@property (nonatomic, assign) BOOL loaded;

/**
 *  数据是否为空
 *
 *  条件：无数据
 */
@property (nonatomic, assign, readonly) BOOL isEmpty;

/**
 *  刷新数据
 */
- (void)refresh;
@end
